GitConverter/src/Catalogs/ХранилищаКонфигураций/ХранилищаКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищаКонфигураций</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРепозиторияGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйПроект</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияEDTCLI</name>
    <type>
      <types>CatalogRef.ВерсииEDT</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВGit</name>
    <type>
      <types>CatalogRef.ВерсииХранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьКоммиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьМеткиСВерсиейКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИспользованиеОбщихОчередей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроектаEDT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогДляАрхивацииОшибок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоммитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛокальныйКаталогGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоПодготавливаемыхВерсий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьЛогирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьКоммитыВРепозиторийGit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчищатьНедостижимыеСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервераGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервераGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПомещатьАнонимноЕслиНеНайденПользователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХранилища</name>
    <type>
      <types>EnumRef.ТипыХранилищаКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбрабатыватьВсеОчереди</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьВременныеДанныеВерсииПослеКоммита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьКонфигурацииПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GitConverter/src/InformationRegisters/СостоянияВерсий/СостоянияВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияВерсий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачалоСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ВерсииХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GitConverter/src/Enums/СостоянияВерсии/СостоянияВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВерсии</name>
  <enumValues>
    <name>ПолучаетсяCF</name>
  </enumValues>
  <enumValues>
    <name>ПолученCF</name>
  </enumValues>
  <enumValues>
    <name>ВыгружаетсяВXML</name>
  </enumValues>
  <enumValues>
    <name>ВыгруженаВXML</name>
  </enumValues>
  <enumValues>
    <name>ЗагружаетсяВEDT</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженаВEDT</name>
  </enumValues>
  <enumValues>
    <name>ПомещаетсяВGit</name>
  </enumValues>
  <enumValues>
    <name>ПомещенаВGit</name>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Catalogs/ВерсииХранилища/ВерсииХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииХранилища</name>
  <owners>Catalog.ХранилищаКонфигураций</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозниклаОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженыТолькоИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>CatalogRef.ОчередиВыполнения</types>
      <types>CatalogRef.КопииХранилищКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПолнаяВыгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GitConverter/src/Catalogs/ХранилищаКонфигураций/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	Элементы.ВерсияПлатформы.ПодсказкаВвода = КонвертацияХранилищаПовтИсп.ВерсияПлатформыПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтключитьОбработчикОжидания("ОбновитьСостояниеНаКлиенте");
	Если ОбновлятьСостояниеАвтоматически Тогда
		ПодключитьОбработчикОжидания("ОбновитьСостояниеНаКлиенте", 10);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОтключитьОбработчикОжидания("ОбновитьСостояниеНаКлиенте");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ОграничитьДиапазонВерсий Тогда
		ТекущийОбъект.ПерваяВерсия = 0;
		ТекущийОбъект.ПоследняяВерсия = 0;
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Расписание", Расписание);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Использование", Объект.ИспользованиеЗадания);
	Если ТекущийОбъект.Наименование = ТекущийАдрес Тогда
		ТекущийОбъект.Наименование = ТекущийОбъект.Адрес;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьСостояниеНаКлиенте();
	ТекущийАдрес = Объект.Адрес;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Возврат; // Действие не требуется.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВерсияПлатформыВыгрузкиПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПлатформыХранилищаПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеЗаданияПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ДиалогРасписания.Показать(Новый ОписаниеОповещения("РасписаниеСтрокойНажатиеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЛогаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ИмяФайлаЛога) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	
	ИмяФайла = "";
	ПрочитатьТекстовыйФайлНаСервере(ИмяФайлаЛога, Текст, ИмяФайла);
	
	Текст.Показать(ИмяФайла, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокальныйКаталогGitПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресРепозиторияGitПриИзменении(Элемент)
	
	ПриИзмененииПараметровДоступаКРепозиторию();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательСервераGitПриИзменении(Элемент)
	
	ПриИзмененииПараметровДоступаКРепозиторию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольСервераGitПриИзменении(Элемент)
	
	ПриИзмененииПараметровДоступаКРепозиторию();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипХранилищаПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьДиапазонВерсийПриИзменении(Элемент)
	
	Если Не ОграничитьДиапазонВерсий Тогда
		Объект.ПерваяВерсия = 0;
		Объект.ПоследняяВерсия = 0;
	КонецЕсли;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеХранилищаТекстыОшибокНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗаголовокЛога = СтрШаблон(НСтр("ru = 'Конвертация хранилища %1'"), Объект.Наименование);
	ОбщегоНазначенияКлиент.ПоказатьТекст(СостояниеХранилища.ТекстыОшибок, ЗаголовокЛога, "repo_log.txt");
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьСостояниеАвтоматическиПриИзменении(Элемент)
	ОтключитьОбработчикОжидания("ОбновитьСостояниеНаКлиенте");
	Если ОбновлятьСостояниеАвтоматически Тогда
		ПодключитьОбработчикОжидания("ОбновитьСостояниеНаКлиенте", 10);
		ОбновитьСостояние(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
	
	ОбновитьСостояниеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьКонвертацию(Команда)
	
	Если Модифицированность И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьКонвертациюНаСервере();
	Если Не ОбновлятьСостояниеАвтоматически Тогда
		ОбновлятьСостояниеАвтоматически = Истина;
		ПодключитьОбработчикОжидания("ОбновитьСостояниеНаКлиенте", 10);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоммиты(Команда)
	
	Если Модифицированность И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьКоммитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлонироватьРепозиторийGit(Команда)
	Если Не ЗначениеЗаполнено(Объект.ЛокальныйКаталогGit) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан локальный каталог репозитория Git'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("СоздатьРепозиторийGitНаСервереОтвет", ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
		Результат = ПолучитьВеткиРепозиторияGitНаКлиенте();
		Если Не Результат.Успех Тогда
			Возврат;
		КонецЕсли;
		Если Результат.Ветки.Количество() > 0 Тогда
			ТекстВопроса = СтрШаблон(
				НСтр("ru = 'Репозиторий на сервере не пустой, содержит ветки (%1).'"),
				Результат.Ветки.Количество());
			Кнопки = Новый СписокЗначений;
			Если Результат.Ветки.Найти(Объект.ИмяВетки) <> Неопределено Тогда
				Кнопки.Добавить("КлонироватьТолькоЭтуВетку", НСтр("ru = 'Клонировать одну ветку (рекомендуется)'"));
				Кнопки.Добавить("КлонироватьСуществующуюВетку", НСтр("ru = 'Клонировать ветку'"));
			Иначе
				Кнопки.Добавить("КлонироватьИСоздатьВетку", НСтр("ru = 'Клонировать и создать ветку'"));
			КонецЕсли;
			Кнопки.Добавить("СоздатьНовый", НСтр("ru = 'Создать локальный репозиторий и установить адрес'"));
			Кнопки.Добавить(КодВозвратаДиалога.Отмена);
			Если РепозиторийСоздан Тогда
				ТекстВопроса = НСтр("ru = 'Внимание. Текущий каталог локального репозитория будет полностью очищен.'")
					+ Символы.ПС + ТекстВопроса;
				ЗаголовокВопроса = НСтр("ru = 'Пересоздание локального репозитория'");
			Иначе
				ЗаголовокВопроса = НСтр("ru = 'Создание локального репозитория'");
			КонецЕсли;
			ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , , ТекстВопроса);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если РепозиторийСоздан Тогда
		ТекстВопроса = НСтр("ru = 'Внимание. Текущий каталог локального репозитория будет полностью очищен.'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("СоздатьНовый", НСтр("ru = 'Создать локальный репозиторий'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ЗаголовокВопроса = НСтр("ru = 'Пересоздание локального репозитория'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , , ТекстВопроса);
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Оповещение, "СоздатьНовый");
КонецПроцедуры

&НаКлиенте
Процедура ОптимизироватьРепозиторийGit(Команда)
	Результат = ОптимизироватьРепозиторийGitНаСервере();
	ОбщегоНазначенияКлиент.ПоказатьТекст(Результат.Лог, НСтр("ru = 'Лог оптимизации репозитория'"), "GitRepoOptimize_log.txt");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВерсииИзОтчетаПоХранилищу(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Отчет по версиям хранилища(*.mxl)|*.mxl";
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьВерсииИзОтчетаПоХранилищуВыбор", ЭтотОбъект);
	
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАдресРепозиторияGit(Команда)
	Если Не ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не заполнен адрес репозитория на сервере Git'"));
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьВеткиРепозиторияGitНаКлиенте();
	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Ветки.Найти(Объект.ИмяВетки) <> Неопределено Тогда
		
		Оповещение = Новый ОписаниеОповещения("УстановитьАдресРепозиторияGitОтвет", ЭтотОбъект);
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Ветка %1 существует на сервере. При отправке изменений могут возникнуть конфилкты, которые необходимо будет разрешить вручную.
									  |Установить адрес сервера?'"), Объект.ИмяВетки);
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Понимаю, установить адрес сервера!'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Выбрать другую ветку'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, ,КодВозвратаДиалога.Отмена, НСтр("ru = 'Внимание!'"));
		Возврат;
	КонецЕсли;
	
	УстановитьАдресРепозиторияGitНаКлиенте(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступКРепозиториюGit(Команда)
	Если Не ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не заполнен адрес репозитория на сервере Git'"));
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьВеткиРепозиторияGitНаКлиенте();
	
	Если Результат.Успех Тогда
		Тексты = Новый Массив;
		Тексты.Добавить(НСтр("ru = 'Проверка доступа к репозиторию на сервере выполнена успешно.'"));
		Тексты.Добавить(СтрШаблон(НСтр("ru = 'Количество веток на сервере: %1.'"), Результат.Ветки.Количество()));
		Если ЗначениеЗаполнено(Объект.ИмяВетки) Тогда
			Если Элементы.ИмяВетки.СписокВыбора.НайтиПоЗначению(Объект.ИмяВетки) <> Неопределено Тогда
				Тексты.Добавить(СтрШаблон(НСтр("ru = 'Ветка %1 найдена на сервере.'"), Объект.ИмяВетки));
			Иначе
				Тексты.Добавить(СтрШаблон(НСтр("ru = 'Внимание. Ветка %1 НЕ найдена на сервере.'"), Объект.ИмяВетки));
			КонецЕсли;
		КонецЕсли;
		ПоказатьПредупреждение(, СтрСоединить(Тексты, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВетку(Команда)
	Если Не ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан адрес репозитория на сервере Git'"));
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьВеткиРепозиторияGitНаКлиенте();
	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Ветки.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВыборИмениВеткиОтвет", ЭтотОбъект);
		Элемент = Элементы.ИмяВетки.СписокВыбора.НайтиПоЗначению(Объект.ИмяВетки);
		Элементы.ИмяВетки.СписокВыбора.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите ветку серверного репозитория'"), Элемент);
	Иначе
		ПоказатьПредупреждение( , НСтр("ru = 'На сервере 0 веток.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтатистику(Команда)
	ОбновитьСтатистикуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	Элементы.РекомендуетсяПроверитьGitГруппа.Видимость = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ТипХранилища) Тогда
		Объект.ТипХранилища = Метаданные.Справочники.ХранилищаКонфигураций.Реквизиты.ТипХранилища.ЗначениеЗаполнения;
	КонецЕсли;
	
	ФайлCLI = КонвертацияХранилищаПовтИсп.ФайлПрограммногоИнтерфейсаEDT(Объект.ВерсияEDTCLI);
	ФайлCLIСуществует = ОбщегоНазначения.ФайлСуществует(ФайлCLI);
	
	ОбновитьСостояниеНаСервере();
	
	УстановитьПривилегированныйРежим(Истина);
	Задание = РегламентныеЗаданияСервер.Задание(Объект.ИдентификаторЗадания);
	Если Задание <> Неопределено Тогда
		Объект.ИспользованиеЗадания = Задание.Использование;
		Расписание = Задание.Расписание;
		РасписаниеСтрокой = Строка(Расписание);
	Иначе
		Объект.ИспользованиеЗадания = Ложь;
		Расписание = Новый РасписаниеРегламентногоЗадания;
		РасписаниеСтрокой = РасписаниеСтрокой + Строка(Расписание);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ТекущийАдрес = Объект.Адрес;
	
	ОграничитьДиапазонВерсий = ЗначениеЗаполнено(Объект.ПерваяВерсия) Или ЗначениеЗаполнено(Объект.ПоследняяВерсия);
	
	КаталогВременныхФайлов = Объект.КаталогВыгрузкиВерсий + "Common" + ПолучитьРазделительПути();
	ИмяФайлаЛога = ОбщегоНазначения.ИмяФайлаЛога(КаталогВременныхФайлов, "ReportDB");
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	РепозиторийСоздан = ЗначениеЗаполнено(Объект.ЛокальныйКаталогGit)
		И ОбщегоНазначения.КаталогСуществует(Объект.ЛокальныйКаталогGit + ПолучитьРазделительПути() + ".git");
	
	ОбщегоНазначения.ОбновитьСвертываемыеГруппы(ЭтотОбъект);
	
	Элементы.ВерсияПлатформы.ЦветФона = ?(ЗначениеЗаполнено(Объект.ВерсияПлатформы), ЦветаСтиля.ФонУправляющегоПоля, Новый Цвет);
	
	ЭтоРасширение = Объект.ТипХранилища = Перечисления.ТипыХранилищаКонфигураций.Расширение;
	Элементы.БазовыйПроект.Видимость = ЭтоРасширение;
	Элементы.ИмяРасширения.Видимость = ЭтоРасширение;
	
КонецПроцедуры

#Область СвертываемыеГруппы

&НаСервере
Процедура ПриОпределенииСвертываемыхГрупп(Группы) Экспорт
	Группы.Добавить(Элементы.Хранилище1СГруппа);
	Группы.Добавить(Элементы.EDTГруппа);
	Группы.Добавить(Элементы.ВыгрузкаXMLГруппа);
	Группы.Добавить(Элементы.НастройкиГруппа);
	Группы.Добавить(Элементы.GitГруппа);
	Группы.Добавить(Элементы.РезультатыГруппа);
	Группы.Добавить(Элементы.СтатистикаГруппа);
КонецПроцедуры

&НаСервере
Процедура ПослеДобавленияЭлементовСвертываемыхГрупп() Экспорт
	Элементы.Переместить(Элементы.ОбновитьСостояниеГруппа, Элементы.РезультатыГруппа.Родитель.ПодчиненныеЭлементы[0]);
КонецПроцедуры

&НаСервере
Процедура ПриОпределенииСвойствСвертываемойГруппы(Группа, НастройкиГруппы) Экспорт
	
	Если Группа = Элементы.Хранилище1СГруппа Тогда
		ОбновитьЭлементыГруппыХранилище1С(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.EDTГруппа Тогда
		ОбновитьЭлементыГруппыEDT(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.ВыгрузкаXMLГруппа Тогда
		ОбновитьЭлементыГруппыВыгрузкаXML(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.НастройкиГруппа Тогда
		ОбновитьЭлементыГруппыНастройки(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.GitГруппа Тогда
		ОбновитьЭлементыГруппыGit(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.РезультатыГруппа Тогда
		ОбновитьЭлементыГруппыРезультаты(Группа, НастройкиГруппы);
		
	ИначеЕсли Группа = Элементы.СтатистикаГруппа Тогда
		ОбновитьЭлементыГруппыСтатистика(Группа, НастройкиГруппы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвернутьРазвернутьГруппу(Элемент) Экспорт
	СвернутьРазвернутьГруппу(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура СвернутьРазвернутьГруппу(ИмяЭлемента)
	ОбщегоНазначения.СвернутьРазвернутьГруппу(ЭтотОбъект, ИмяЭлемента);
КонецПроцедуры

#КонецОбласти

#Область Хранилище1С

&НаСервере
Процедура ОбновитьЭлементыГруппыХранилище1С(Группа, НастройкиГруппы)
	НастройкиГруппы.Обязательная = Истина;
	НастройкиГруппы.Заполнена = ЗначениеЗаполнено(Объект.Адрес) И ЗначениеЗаполнено(Объект.ИмяПользователяХранилища);
	Если НастройкиГруппы.Развернута Тогда
		Если ЗначениеЗаполнено(Объект.ВерсияПлатформы) Тогда
			Элементы.ВерсияПлатформыХранилища.ПодсказкаВвода = Объект.ВерсияПлатформы;
		Иначе
			Элементы.ВерсияПлатформыХранилища.ПодсказкаВвода = КонвертацияХранилищаПовтИсп.ВерсияПлатформыПоУмолчанию();
		КонецЕсли;
		Элементы.ПерваяВерсия.Видимость = ОграничитьДиапазонВерсий;
		Элементы.ПоследняяВерсия.Видимость = ОграничитьДиапазонВерсий;
	ИначеЕсли НастройкиГруппы.Заполнена Тогда
		Представления = Новый Массив;
		Представления.Добавить(Объект.Адрес);
		Представления.Добавить(Объект.ИмяПользователяХранилища);
		Если ЗначениеЗаполнено(Объект.ВерсияПлатформыХранилища) Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Платформа %1'"), Объект.ВерсияПлатформыХранилища));
		КонецЕсли;
		Если ОграничитьДиапазонВерсий Тогда
			Если ЗначениеЗаполнено(Объект.ПерваяВерсия) Тогда
				Представления.Добавить(СтрШаблон(НСтр("ru = 'с коммита %1'"), Формат(Объект.ПерваяВерсия, "ЧГ=")));
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.ПоследняяВерсия) Тогда
				Представления.Добавить(СтрШаблон(НСтр("ru = 'до коммита %1'"), Формат(Объект.ПоследняяВерсия, "ЧГ=")));
			КонецЕсли;
		Иначе
			Представления.Добавить(НСтр("ru = 'без ограничений по номеру'"));
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаXML

&НаСервере
Процедура ОбновитьЭлементыГруппыВыгрузкаXML(Группа, НастройкиГруппы)
	НастройкиГруппы.Заполнена = Истина;
	Если Не НастройкиГруппы.Развернута Тогда
		Представления = Новый Массив;
		Если Объект.ВыгружатьИзменения Тогда
			Представления.Добавить(НСтр("ru = 'Выгружать изменения'"));
		КонецЕсли;
		Если Объект.УдалятьКонфигурацииПоставщиков Тогда
			Представления.Добавить(НСтр("ru = 'Удалять конфигурации поставщиков'"));
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область EDT

&НаСервере
Процедура ОбновитьЭлементыГруппыEDT(Группа, НастройкиГруппы)
	НастройкиГруппы.Обязательная = Истина;
	НастройкиГруппы.Заполнена = ФайлCLIСуществует;
	Если НастройкиГруппы.Развернута Тогда
		Если ФайлCLIСуществует Тогда
			Элементы.ФайлEDTПодсказка.Заголовок = ФайлCLI;
		Иначе
			Элементы.ФайлEDTПодсказка.Заголовок = СтрШаблон(НСтр("ru = 'На сервере не найден файл EDT по пути ""%1"".'"), ФайлCLI);
		КонецЕсли;
	ИначеЕсли НастройкиГруппы.Заполнена Тогда
		Представления = Новый Массив;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВерсийEDT")
			И ЗначениеЗаполнено(Объект.ВерсияEDTCLI) Тогда
			Представления.Добавить(Объект.ВерсияEDTCLI);
		ИначеЕсли ФайлCLIСуществует Тогда
			Представления.Добавить(ФайлCLI);
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Git

&НаСервере
Процедура ОбновитьЭлементыГруппыGit(Группа, НастройкиГруппы)
	НастройкиГруппы.Обязательная = Истина;
	НастройкиГруппы.Заполнена = ЗначениеЗаполнено(Объект.ЛокальныйКаталогGit) И ЗначениеЗаполнено(Объект.ИмяВетки);
	Если НастройкиГруппы.Развернута Тогда
		
		ЕстьРепозиторий = ЗначениеЗаполнено(Объект.АдресРепозиторияGit);
		
		Элементы.УстановитьАдресРепозиторияGit.Видимость = ЕстьРепозиторий И РепозиторийСоздан;
		Элементы.ПроверитьДоступКРепозиториюGit.Видимость = ЕстьРепозиторий;
		Элементы.ПользовательСервераGit.Видимость = ЕстьРепозиторий;
		Элементы.ПарольСервераGit.Видимость = ЕстьРепозиторий;
		Элементы.ВыбратьВетку.Видимость = ЕстьРепозиторий;
		Элементы.РепозиторийПользовательПарольГруппа.Видимость = ЕстьРепозиторий;
		Элементы.СоздатьКлонироватьРепозиторийGit.Видимость = Не РепозиторийСоздан;
		Элементы.ОптимизироватьРепозиторийGit.Видимость = РепозиторийСоздан;
		Элементы.ПересоздатьЛокальныйРепозиторийGit.Видимость = РепозиторийСоздан;
		
		Если Элементы.СоздатьКлонироватьРепозиторийGit.Видимость Тогда
			Элементы.СоздатьКлонироватьРепозиторийGit.Заголовок = ?(ЕстьРепозиторий, НСтр("ru = 'Создать'"), НСтр("ru = 'Клонировать'"));
		КонецЕсли;
		
		
	Иначе
		Представления = Новый Массив;
		Если ЗначениеЗаполнено(Объект.АдресРепозиторияGit) Тогда
			Представления.Добавить(Объект.АдресРепозиторияGit);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ИмяВетки) Тогда
			Представления.Добавить(Объект.ИмяВетки);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ПользовательСервераGit) Тогда
			Представления.Добавить(Объект.ПользовательСервераGit);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ЛокальныйКаталогGit) Тогда
			Представления.Добавить(Объект.ЛокальныйКаталогGit);
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Настройки

&НаСервере
Процедура ОбновитьЭлементыГруппыНастройки(Группа, НастройкиГруппы)
	НастройкиГруппы.Заполнена = Истина;
	Если Не НастройкиГруппы.Развернута Тогда
		Представления = Новый Массив;
		Если Объект.ЗапретитьИспользованиеОбщихОчередей Тогда
			Представления.Добавить(НСтр("ru = 'Не использовать общие очереди'"));
		Иначе
			Представления.Добавить(НСтр("ru = 'Использовать общие очереди'"));
		КонецЕсли;
		Если Объект.УдалятьВременныеДанныеВерсииПослеКоммита Тогда
			Представления.Добавить(НСтр("ru = 'Удалять временные файлы'"));
		Иначе
			Представления.Добавить(НСтр("ru = 'Не удалять временные файлы'"));
		КонецЕсли;
		Если Объект.ОтключитьЛогирование Тогда
			Представления.Добавить(НСтр("ru = 'Логирование отключено'"));
		Иначе
			Представления.Добавить(НСтр("ru = 'Логирование включено'"));
		КонецЕсли;
		Если Объект.МаксимальноеКоличествоПодготавливаемыхВерсий > 0 Тогда
			КоличествоВерсий = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru=';%1 версия;;%1 версии;%1 версий;'"),
				Объект.МаксимальноеКоличествоПодготавливаемыхВерсий);
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Пул: %1'"), КоличествоВерсий));
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Результаты

&НаСервере
Процедура ОбновитьЭлементыГруппыРезультаты(Группа, НастройкиГруппы)
	НастройкиГруппы.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	Если Не НастройкиГруппы.Видимость Тогда
		Возврат;
	КонецЕсли;
	НастройкиГруппы.Заполнена = Истина;
	Если Не НастройкиГруппы.Развернута Тогда
		Представления = Новый Массив;
		Если ЗначениеЗаполнено(Объект.ВерсияВGit) Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Помещен коммит: %1'"), Объект.ВерсияВGit));
		КонецЕсли;
		Если ЗначениеЗаполнено(СостояниеХранилища.НачалоОбработки) Тогда
			Если СостояниеХранилища.ЗавершениеОбработки > СостояниеХранилища.НачалоОбработки Тогда
				Шаблон = НСтр("ru = 'Последний запуск: %1, продолжительность %2'");
				ВремяВСекундах = СостояниеХранилища.ЗавершениеОбработки - СостояниеХранилища.НачалоОбработки;
			Иначе
				Шаблон = НСтр("ru = 'Последний запуск: %1, продолжительность %2'");
				ВремяВСекундах = ТекущаяДатаСеанса() - СостояниеХранилища.НачалоОбработки;
			КонецЕсли;
			Длительность = ОбщегоНазначения.ПредставлениеДлительностиКраткое(ВремяВСекундах);
			Если СостояниеХранилища.НачалоОбработки < НачалоДня(ТекущаяДатаСеанса()) Тогда
				Начало = Формат(СостояниеХранилища.НачалоОбработки, "ДЛФ=D");
			Иначе
				Начало = Формат(СостояниеХранилища.НачалоОбработки, "ДЛФ=T");
			КонецЕсли;
			Представления.Добавить(СтрШаблон(Шаблон, Начало, Длительность));
		КонецЕсли;
		Если СостояниеХранилища.ВозниклаОшибка Тогда
			Представления.Добавить(НСтр("ru = 'Возникла ошибка'"));
		КонецЕсли;
		Если СостояниеХранилища.КоличествоОшибок > 0 Тогда
			Представления.Добавить(СтрШаблон(НСтр("ru = 'Количество ошибок: %1'"), СостояниеХранилища.КоличествоОшибок));
		ИначеЕсли Не СостояниеХранилища.ВозниклаОшибка Тогда
			Представления.Добавить(НСтр("ru = 'Ошибок нет'"));
		КонецЕсли;
		НастройкиГруппы.Представление = СтрСоединить(Представления, ", ");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеНаКлиенте()
	ОбновитьСостояниеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Чтение регистра. РегистрСведенийМенеджерЗаписи.<Имя регистра сведений>.
	МенеджерЗаписи = РеквизитФормыВЗначение("СостояниеХранилища");
	МенеджерЗаписи.Хранилище = Объект.Ссылка;
	МенеджерЗаписи.Прочитать();
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "СостояниеХранилища");
КонецПроцедуры

#КонецОбласти

#Область Статистика

&НаСервере
Процедура ОбновитьЭлементыГруппыСтатистика(Группа, НастройкиГруппы)
	НастройкиГруппы.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	Если Не НастройкиГруппы.Видимость Тогда
		Возврат;
	КонецЕсли;
	НастройкиГруппы.Заполнена = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикуНаСервере()
	Для Каждого Элемент1 Из Элементы.СтатистикаГруппа.ПодчиненныеЭлементы Цикл
		Элемент1.Видимость = Истина;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещенаВGit)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ЗагруженаВEDT),
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещаетсяВGit))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И
	|	НЕ ВерсииХранилища.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещаетсяВGit), ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещенаВGit))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество,
	|	МАКСИМУМ(СостоянияВерсииСрезПоследних.Период) КАК Окончание,
	|	МИНИМУМ(СостоянияВерсииСрезПоследних.Период) КАК Начало
	|ПОМЕСТИТЬ ОбщаяСкорость
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВерсий.СрезПоследних КАК СостоянияВерсииСрезПоследних
	|		ПО ВерсииХранилища.Ссылка = СостоянияВерсииСрезПоследних.ВерсияХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещенаВGit)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ОбщаяСкорость.Начало, ОбщаяСкорость.Окончание, ЧАС) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОбщаяСкорость.Количество / РАЗНОСТЬДАТ(ОбщаяСкорость.Начало, ОбщаяСкорость.Окончание, ЧАС)
	|	КОНЕЦ КАК Скорость
	|ИЗ
	|	ОбщаяСкорость КАК ОбщаяСкорость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВерсииХранилища.Ссылка) КАК Количество,
	|	МАКСИМУМ(СостоянияВерсииСрезПоследних.Период) КАК Окончание,
	|	МИНИМУМ(СостоянияВерсииСрезПоследних.Период) КАК Начало
	|ПОМЕСТИТЬ ТекущаяСкорость
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВерсий.СрезПоследних КАК СостоянияВерсииСрезПоследних
	|		ПО ВерсииХранилища.Ссылка = СостоянияВерсииСрезПоследних.ВерсияХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|	И ВерсииХранилища.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВерсии.ПомещенаВGit)
	|	И СостоянияВерсииСрезПоследних.Период >= &ПредыдущаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ТекущаяСкорость.Начало, ТекущаяСкорость.Окончание, ЧАС) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ТекущаяСкорость.Количество / РАЗНОСТЬДАТ(ТекущаяСкорость.Начало, ТекущаяСкорость.Окончание, ЧАС)
	|	КОНЕЦ КАК Скорость
	|ИЗ
	|	ТекущаяСкорость КАК ТекущаяСкорость";
	
	Запрос.УстановитьПараметр("ПредыдущаяДата", ТекущаяДатаСеанса() - 86400);
	Запрос.УстановитьПараметр("Хранилище", Объект.Ссылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[0].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	ВсегоВерсий = ВыборкаДетальныеЗаписи.Количество;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[1].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	ВыполненоКоммитов = ВыборкаДетальныеЗаписи.Количество;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[2].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	КоличествоВерсийОбработано = ВыборкаДетальныеЗаписи.Количество;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[3].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	КоличествоПодготавливаемыхВерсий = ВыборкаДетальныеЗаписи.Количество;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[5].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	СредняяСкорость = ВыборкаДетальныеЗаписи.Скорость;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[7].Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	СредняяСкоростьЗаСутки = ВыборкаДетальныеЗаписи.Скорость;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗапуститьКонвертациюНаСервере()
	
	ОбщегоНазначения.ВыполнитьВФоне(
		Строка(Объект.Ссылка.УникальныйИдентификатор()),
		"КонвертацияХранилища.ВыполнитьКонвертацию",
		Лев(СтрШаблон(НСтр("ru = 'Конвертация хранилища: %1'"), СокрЛП(Объект.Адрес)), 120),
		Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКоммитыНаСервере()
	
	КонвертацияХранилища.ЗапуститьКоммитыВФоне(Объект.Ссылка);
	
	ОбновитьСостояниеНаСервере();
	
КонецПроцедуры

// Параметры:
// 	Расписание1 - РасписаниеРегламентногоЗадания, Неопределено -
// 	ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура РасписаниеСтрокойНажатиеЗавершение(Расписание1, ДополнительныеПараметры) Экспорт
	
	Если Расписание1 <> Неопределено Тогда
		
		Модифицированность = Истина;
		Расписание         = Расписание1;
		РасписаниеСтрокой  = Строка(Расписание);
		
	КонецЕсли;

КонецПроцедуры

// Параметры:
// 	ВыбранныеФайлы - Неопределено, Массив из Строка -
// 	ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ЗагрузитьВерсииИзОтчетаПоХранилищуВыбор(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныеФайлы = Неопределено ИЛИ ВыбранныеФайлы.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли; 
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьВерсииИзОтчетаПоХранилищуПослеПомещения", ЭтотОбъект);
	
	НачатьПомещениеФайла(Оповещение, , ПолноеИмяФайла, Ложь, УникальныйИдентификатор);
	
	
КонецПроцедуры

// Параметры:
// 	Результат - Булево
// 	АдресФайла - Строка
// 	ВыбранноеИмяФайла - Строка
// 	ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ЗагрузитьВерсииИзОтчетаПоХранилищуПослеПомещения(Результат, АдресФайла, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли; 
	
	ЗагрузитьВерсииИзОтчетаПоХранилищуНаСервере(АдресФайла);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВерсииИзОтчетаПоХранилищуНаСервере(АдресФайла)
	
	Файл = ПолучитьИзВременногоХранилища(АдресФайла); // ДвоичныеДанные - 
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("mxl");
	Файл.Записать(ИмяВременногоФайла);
	
	Справочники.ВерсииХранилища.ЗагрузитьВерсииИзОтчета(Объект.Ссылка, ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьАдресРепозиторияGitНаКлиенте(ВеткаСуществует)
	Результат = УстановитьАдресРепозиторияGitНаСервере(Истина);
	Если ЗначениеЗаполнено(Результат.Лог) Тогда
		Если Результат.Успех Тогда
			ЗаголовокЛога = НСтр("ru = 'Успешно установлен адрес репозитория git'");
		Иначе
			ЗаголовокЛога = НСтр("ru = 'Возникла ошибка при установке адреса репозитория git'");
		КонецЕсли;
		ОбщегоНазначенияКлиент.ПоказатьТекст(Результат.Лог, ЗаголовокЛога, "git_origin_connect_log.txt");
	ИначеЕсли Результат.Успех Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Адрес репозитория git успешно установлен'"));
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестная ошибка и лог пустой'");
	КонецЕсли;
КонецФункции

&НаСервере
Функция УстановитьАдресРепозиторияGitНаСервере(Знач ВеткаСуществует)
	Возврат КонвертацияХранилища.УстановитьАдресРепозиторияGit(Объект.Ссылка, ВеткаСуществует);
КонецФункции

&НаСервереБезКонтекста
Процедура ПрочитатьТекстовыйФайлНаСервере(ПутьКФайлу, Текст, ИмяФайла, КодировкаСистемы = Ложь)
	
	ОбщегоНазначения.ПрочитатьТекстовыйФайл(ПутьКФайлу, Текст, ИмяФайла, КодировкаСистемы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРепозиторийGitНаСервереОтвет(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = "СоздатьНовый" Тогда
		Клонировать = Ложь;
		СоздатьВетку = Ложь;
		ОднуВетку = Ложь;
	ИначеЕсли Ответ = "КлонироватьСуществующуюВетку" Тогда
		Клонировать = Истина;
		СоздатьВетку = Ложь;
		ОднуВетку = Ложь;
	ИначеЕсли Ответ = "КлонироватьТолькоЭтуВетку" Тогда
		Клонировать = Истина;
		СоздатьВетку = Ложь;
		ОднуВетку = Истина;
	ИначеЕсли Ответ = "КлонироватьИСоздатьВетку" Тогда
		Клонировать = Истина;
		СоздатьВетку = Истина;
		ОднуВетку = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	Результат = СоздатьРепозиторийGitНаСервере(Клонировать, СоздатьВетку, ОднуВетку);
	ОбщегоНазначенияКлиент.ПоказатьТекст(Результат.Лог, НСтр("ru = 'Лог создания репозитория'"), "GitRepoInit_log.txt");
КонецПроцедуры

&НаСервере
Функция СоздатьРепозиторийGitНаСервере(Знач Клонировать = Ложь, Знач СоздатьВетку = Ложь, Знач ОднуВетку = Ложь)
	Результат = КонвертацияХранилища.СоздатьРепозиторийGit(Объект.Ссылка, Клонировать, СоздатьВетку, ОднуВетку);
	ОбновитьЭлементыФормы();
	Возврат Результат;
КонецФункции

&НаСервере
Функция ОптимизироватьРепозиторийGitНаСервере()
	Возврат КонвертацияХранилища.ОптимизироватьРепозиторийGit(Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура УстановитьАдресРепозиторияGitОтвет(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьАдресРепозиторияGitНаКлиенте(Истина);
	ИначеЕсли  Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.ИмяВетки = "";
		Модифицированность = Истина;
		ЭтотОбъект.ТекущийЭлемент = Элементы.ИмяВетки;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровДоступаКРепозиторию()
	
	Если ЗначениеЗаполнено(Объект.АдресРепозиторияGit) И ЗначениеЗаполнено(Объект.ИмяВетки) Тогда
		Элементы.РекомендуетсяПроверитьGitГруппа.Видимость = Истина;
	Иначе
		Элементы.РекомендуетсяПроверитьGitГруппа.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИмениВеткиОтвет(Ответ, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Ответ) = Тип("ЭлементСпискаЗначений") Тогда
		Объект.ИмяВетки = Ответ.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИменаВеток(Ветки)
	
	Элементы.ИмяВетки.СписокВыбора.Очистить();
	Если Ветки.Найти("master") = Неопределено Тогда
		Элементы.ИмяВетки.СписокВыбора.Добавить("master", НСтр("ru = 'master <ветка не найдена на сервере>'"));
	КонецЕсли;
	Для Каждого Ветка Из Ветки Цикл
		Элементы.ИмяВетки.СписокВыбора.Добавить(Ветка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВеткиРепозиторияGitНаКлиенте()
	РезультатЗапроса = ПолучитьВеткиРепозиторияGit();
	
	Если Не РезультатЗапроса.Успех Тогда
		ОбщегоНазначенияКлиент.ПоказатьТекст(РезультатЗапроса.ТекстОшибки,
			НСтр("ru = 'Не удалось получить список веток репозитория'"),
			"GitGetBranches_log.txt");
	КонецЕсли;
	
	Возврат РезультатЗапроса;
КонецФункции

&НаСервере
Функция ПолучитьВеткиРепозиторияGit()
	РезультатЗапроса = КонвертацияХранилища.ПолучитьВеткиРепозиторияGit(
		Объект.АдресРепозиторияGit,
		Объект.ПользовательСервераGit,
		Объект.ПарольСервераGit);
	
	Если РезультатЗапроса.Успех Тогда
		ОбновитьИменаВеток(РезультатЗапроса.Ветки);
		Элементы.РекомендуетсяПроверитьGitГруппа.Видимость = Ложь;
	Иначе
		Элементы.РекомендуетсяПроверитьGitГруппа.ЦветФона = ЦветаСтиля.ЦветФонаПредупреждения;
	КонецЕсли;
	
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти
